{
  "work": [
    {
      "date": "October 2022 - Present",
      "title": "Software Developer II at Noridian Healthcare Solutions",
      "description": "Collaborate with cross-functional teams to analyze business requirements and translate them into effective EDI solutions. Develop, implement, and maintain EDI processes and protocols to facilitate the seamless exchange of data between internal systems and external partners. Troubleshoot and resolve EDI-related issues, providing timely support to end-users and trading partners. Maintain documentation and training materials for EDI processes and protocols, facilitating knowledge transfer within the team.",
      "stack": [
        "Tibco",
        "EDI",
        "Linux",
        "SQL",
        "Hawk",
        "Agile"
      ]
    },
    {
      "date": "June 2021 - October 2022",
      "title": "Software Developer I at Noridian Healthcare Solutions",
      "description": "In this position I coded, tested, debuged, documented, and maintained programs utilizing programming languages and an understanding of how data is related across multiple databases, tables, and platforms. I also collaborated with other internal teams to resolve advanced and highly visible issues in a timely manner on top of handling installation, configuration, development, workflow design, monitoring, and upgrades of assigned software products. ",
      "stack": [
        "SQL",
        "C#",
        "OnBase",
        "Agile"
      ]
    },
    {
      "date": "May 2020 - August 2020",
      "title": "Intern Software Developer at Blue Cross Blue Shield of North Dakota",
      "description": "I performed a variety of software related tasks and worked on application problems of increasing scope and complexity. I resolved all assigned incidents, requests, and work orders, created and documented procedures, resolutions, and concepts, and troubleshot a range of software problems leveraging knowledge and research while collaborating with senior coworkers in support of enterprise applications, both on-premises and cloud-based.",
      "stack": [
        "C#",
        "SQL",
        "Powershell",
        "SalesForce",
        "SharePoint",
        "ServiceNow",
        "Deltek",
        "Azure DevOps"
      ]
    }

  ]
}
